app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def index
        render(json: Destination.all)

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        destination = Destination.find_by(id: params[:id])

INSERT INTO "destinations" ("name", "distance", "gravity", "temperature", "image_url", "object_type", "temperature_class", "gravity_class", "distance_class", "itinerary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        application = Destination.create(destination_params)

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 40]]
---
    def destroy
        destination = Destination.find_by(id: params[:id])
        destination.destroy