app/controllers/itineraries_controller.rb

    def index
        render(json: Destination.all)
---
SELECT "destinations".* FROM "destinations"